/**
 * @file    bsp_mc_opamp.c
 * @brief   OPA 跟随器 / PGA 初始化
 * @author  CJYS
 * @date    2024/1/1
 */

/* ======================== 1. Header ======================= */
#include "bsp_mc_opamp.h"

/* ======================== 2. Defines ====================== */

/* ======================== 3. Typedefs ===================== */

/* ======================== 4. Globals ====================== */

/* ======================== 5. Function Prototypes ========== */

/* ======================== 6. Functions ==================== */

/**
 * @brief  OPA 初始化（PGA 模式，输出送 CMP 的 P 端）
 */
void BSP_MC_OPAMP_Init(void)
{

}
