/**
 * @file    bsp_mc_dac.c
 * @brief   DAC 阈值输出初始化
 * @author  CJYS
 * @date    2024/1/1
 */

/* ======================== 1. Header ======================= */
#include "bsp_mc_dac.h"

/* ======================== 2. Defines ====================== */

/* ======================== 3. Typedefs ===================== */

/* ======================== 4. Globals ====================== */

/* ======================== 5. Function Prototypes ========== */

/* ======================== 6. Functions ==================== */

/**
 * @brief  DAC 初始化（窗口比较器阈值输出）
 */
void BSP_MC_DAC_Init(void)
{

}
