/**
 * @file    bsp_mc_dma.c
 * @brief   电机控制 DMA 初始化（ADC1 规则组搬运）
 * @author  CJYS
 * @date    2024/1/1
 */

/* ======================== 1. Header ======================= */
#include "bsp_mc_dma.h"
#include "bsp_mc_adc.h"

/* ======================== 2. Defines ====================== */

/* ======================== 3. Typedefs ===================== */

/* ======================== 4. Globals ====================== */

/* ======================== 5. Function Prototypes ========== */

/* ======================== 6. Functions ==================== */

/**
 * @brief  ADC1 规则组 DMA 初始化（预留）
 */
void BSP_MC_DMA_Init(void)
{

}
