/**
 * @file    bsp_mc_adc.c
 * @brief   ADC 初始化
 *          - 单 ADC1：注入组采样电机 BEMF / 电流，规则组采样母线 / 温度 / VR / VBG
 * @author  CJYS
 * @date    2024/1/1
 */

/* ======================== 1. Header ======================= */
#include "bsp_mc_adc.h"

/* ======================== 2. Defines ====================== */

/* ======================== 3. Typedefs ===================== */

/* ======================== 4. Globals ====================== */
Q32U_ BSP_ADC_SYSTEM_BUFFER[10];   /* 规则组数据缓冲区 */

/* ======================== 5. Function Prototypes ========== */

/* ======================== 6. Functions ==================== */

/**
 * @brief  电机控制用 ADC 初始化
 */
void BSP_MC_ADC_Init(void)
{

}