/**
 * @file    bsp_mc_tim.c
 * @brief   TIM 初始化
 *          - HALL 换向计时（TIM2）+ 延迟换向计时（TIM3）
 * @author  CJYS
 * @date    2024/1/1
 */

/* ======================== 1. Header ======================= */
#include "bsp_mc_tim.h"

/* ======================== 2. Defines ====================== */

/* ======================== 3. Typedefs ===================== */

/* ======================== 4. Globals ====================== */

/* ======================== 5. Function Prototypes ========== */

/* ======================== 6. Functions ==================== */

/**
 * @brief  HALL 换向时间计数器 + 延迟换向计数器初始化
 */
void BSP_MC_TIM_Init(void)
{

}
