/**
 * @file    bsp_mc_cmp.c
 * @brief   CMP 窗口比较器初始化
 * @author  CJYS
 * @date    2024/1/1
 */

/* ======================== 1. Header ======================= */
#include "bsp_mc_cmp.h"

/* ======================== 2. Defines ====================== */

/* ======================== 3. Typedefs ===================== */

/* ======================== 4. Globals ====================== */

/* ======================== 5. Function Prototypes ========== */

/* ======================== 6. Functions ==================== */

/**
 * @brief  窗口比较器初始化（COMP2，输出送 TIM8_BKIN）
 */
void BSP_MC_CMP_Init(void)
{

}