/**************************************************************************************************
*     File Name :                        BSP_DMA.c
*     Library/Module Name :              BSP
*     Author :                           CJYS
*     Create Date :                      2024/1/1
*     Abstract Description :             DMA初始化及应用层接口源文件
**************************************************************************************************/
#include "BSP_DMA.h"

Q32U_ Hal_AdcLoopData[8] = {0,0,0,0,0,0,0,0};

/**********************************************************************************************
Function: BSP_DMA_Init_Three_Shunt
Description: 电机控制用DMA初始化
Input: 电流环中断函数
Output: 无
Input_Output: 无
Return: 无
Author: CJYS
***********************************************************************************************/
void BSP_DMA_Init(void)
{
    
}
