/**
 * @file    bsp_lcd_spi.c
 * @brief   LCD SPI 外设初始化
 *          - SPI3 全双工主机，8 位，MSB First，18MHz
 * @author  CJYS
 * @date    2024/1/1
 */

/* ======================== 1. Header ======================= */
#include "bsp_lcd_spi.h"

/* ======================== 2. Defines ====================== */

/* ======================== 3. Typedefs ===================== */

/* ======================== 4. Globals ====================== */

/* ======================== 5. Function Prototypes ========== */

/* ======================== 6. Functions ==================== */

/**
 * @brief  LCD SPI 外设初始化
 */
void BSP_LCD_SPI_Init(void)
{

}
